In [2]:
import pandas as pd
pd.__version__

'2.2.1'

In [4]:
# sample.csv 파일을 pandas에서 사용하는 데이터프레임
# 데이터프레임은 '테이블 형태'를 의미
# 행, 열 -> 엑셀과 비슷
# csv 파일을 불러올 때는 pd.read_csv('경로')
# csv 파일 말고 다른 확장자를 불러올 때는 pd.read_확장자('경로')

df = pd.read_csv('c:/py_data/sample.csv')
df

   bun name  kor  eng bigo
0    1   aa   70   68  NaN
1    2   bb   85   88  NaN
2    3   cc   96   92  Yes
3    4   dd   48   37   No
4    5   ee   85   79  NaN
5    6   ff   88   88  NaN
6    7   gg   57   55   No
7    8   hh   72   79  NaN

In [5]:
type(df)

pandas.core.frame.DataFrame

In [7]:
# 데이터프레임은 Null과 NaN을 같은 취급
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   bun     8 non-null      int64
 1   name    8 non-null      object
 2   kor     8 non-null      int64
 3   eng     8 non-null      int64
 4   bigo    3 non-null      object
dtypes: int64(3), object(2)
memory usage: 448.0+ bytes

In [12]:
# 파이썬에서 인코딩 방식은 기본 정의된 값은 UTF-8 형식이며,
# 인코딩 방식을 따로 지정하지 않는다면 UTF-8로 불러온다.
# 하지만 윈도우에서 한글을 사용하여 파일을 생성하면 대부분
# euc-kr로 생성되며
# euc-kr형식을 불러올때 인코딩 형식을 지정해줘야 한다.
# euc-kr은 다른말로 cp949라고도 한다.
dfKo = pd.read_csv('c:/py_data/sample_ko.csv', encoding = 'cp949')
dfKo

   번호  이름  국어  영어   비고
0   1  aa  70  68  NaN
1   2  bb  85  88  NaN
2   3  cc  96  92  우수자
3   4  dd  48  37  재수강
4   5  ee  85  79  NaN
5   6  ff  88  88  NaN
6   7  gg  57  55  재수강
7   8  hh  72  79  NaN

In [14]:
type(dfKo)

pandas.core.frame.DataFrame

In [15]:
dfKo['번호']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: 번호, dtype: int64

In [16]:
# 컬럼 1개는 series라는 자료형이 되며
# 시리즈가 1개 이상 모이면 데이터프레임이 된다.
type(dfKo['번호'])

pandas.core.series.Series

In [20]:
# 여러 컬럼을 볼 수 있는데, 출력할 컬럼이 1개 이상이라면,
# 리스트로 묶어서 입력한다.
dfKo[['이름', '영어', '국어']]

   이름  영어  국어
0  aa  68  70
1  bb  88  85
2  cc  92  96
3  dd  37  48
4  ee  79  85
5  ff  88  88
6  gg  55  57
7  hh  79  72

In [22]:
# .head(n)는 상위 n개의 데이터를 보여준다.
# 생략시 디폴트값은 5개
dfKo.head()

   번호  이름  국어  영어   비고
0   1  aa  70  68  NaN
1   2  bb  85  88  NaN
2   3  cc  96  92  우수자
3   4  dd  48  37  재수강
4   5  ee  85  79  NaN

In [23]:
dfKo.tail()

   번호  이름  국어  영어   비고
3   4  dd  48  37  재수강
4   5  ee  85  79  NaN
5   6  ff  88  88  NaN
6   7  gg  57  55  재수강
7   8  hh  72  79  NaN

In [24]:
df.columns

Index(['bun', 'name', 'kor', 'eng', 'bigo'], dtype='object')

In [28]:
df.columns[3]

'eng'

In [29]:
df[df.columns[3]]

0    68
1    88
2    92
3    37
4    79
5    88
6    55
7    79
Name: eng, dtype: int64

In [30]:
df.values

array([[1, 'aa', 70, 68, nan],
       [2, 'bb', 85, 88, nan],
       [3, 'cc', 96, 92, 'Yes'],
       [4, 'dd', 48, 37, 'No'],
       [5, 'ee', 85, 79, nan],
       [6, 'ff', 88, 88, nan],
       [7, 'gg', 57, 55, 'No'],
       [8, 'hh', 72, 79, nan]], dtype=object)